[
  {
    "interaction_id": 0,
    "from_nodes": [
      0
    ],
    "to_nodes": [
      3
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "Gropius had met Itten in 1918 in Vienna, where he was directing a private school, and— impressed by his theory of education— Gropius called him to the Bauhaus as the first collaborator.",
    "step_id": 0,
    "edge_type": null
  },
  {
    "interaction_id": 1,
    "from_nodes": [
      3
    ],
    "to_nodes": [
      6
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "Itten created the foundations of the preliminary course. Students underwent as a trial period for 6 months. This course was intended to liberate the student's creative power, to give him an understanding of nature's materials, and to acquaint him with the basic principles which underly all creative activity in the visual arts.",
    "step_id": 0,
    "edge_type": null
  },
  {
    "interaction_id": 2,
    "from_nodes": [
      19
    ],
    "to_nodes": [
      18
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "Pillar 1: detailed study of nature through representation of materials.",
    "step_id": 0,
    "edge_type": null
  },
  {
    "interaction_id": 3,
    "from_nodes": [
      19
    ],
    "to_nodes": [
      18
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "Pillar 1: detailed study of nature through experimentation with actual materials.",
    "step_id": 0,
    "edge_type": null
  },
  {
    "interaction_id": 4,
    "from_nodes": [
      19
    ],
    "to_nodes": [
      27
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "Pillar 2: plastic studies of composition, with various materials",
    "step_id": 0,
    "edge_type": null
  },
  {
    "interaction_id": 5,
    "from_nodes": [
      32
    ],
    "to_nodes": [
      33
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "Pillar 3: Analyses of old masters",
    "step_id": 0,
    "edge_type": null
  },
  {
    "interaction_id": 6,
    "from_nodes": [
      35,36
    ],
    "to_nodes": [
      6
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "Taught preliminary curriculum after move to Dessau.",
    "step_id": 0,
    "edge_type": null
  },
  {
    "interaction_id": 7,
    "from_nodes": [
      32
    ],
    "to_nodes": [
      16
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "At the Bauhaus, those starting to work in weaving or in any other craft were fortunate to have had no traditional training, lending them a freedom of approach and courage to their work.",
    "step_id": 1,
    "edge_type": null
  },
  {
    "interaction_id": 8,
    "from_nodes": [
      38
    ],
    "to_nodes": [
      32
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "More systematic training in the mechanics of weaving was introduced, as well as a course in the dyeing of yarns",
    "step_id": 1,
    "edge_type": null
  },
  {
    "interaction_id": 9,
    "from_nodes": [
      32
    ],
    "to_nodes": [
      26
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "The physical qualities of materials became a subject of interest. Light-reflecting and sound-absorbing materials were developed.",
    "step_id": 1,
    "edge_type": null
  },
  {
    "interaction_id": 10,
    "from_nodes": [
      26
    ],
    "to_nodes": [
      39
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "The desire to reach a larger group of consumers brought about a transition from handwork to machine-work: work by hand was for the laboratory only; work by machine was for mass production.",
    "step_id": 1,
    "edge_type": null
  },
  {
    "interaction_id": 11,
    "from_nodes": [
      39
    ],
    "to_nodes": [
      44
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "Aroused the interest of industry.",
    "step_id": 1,
    "edge_type": null
  },
  {
    "interaction_id": 12,
    "from_nodes": [
      32
    ],
    "to_nodes": [
      25
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "Technical composition of the painting ground: lime plaster, plaster of paris, gypsum plaster, marble and alabaster dust plasters for tempera painting; spatter painting (airbrush) on plaster, wood and metal; preparation of the ground for panel pictures.",
    "step_id": 2,
    "edge_type": null
  },
  {
    "interaction_id": 13,
    "from_nodes": [
      32
    ],
    "to_nodes": [
      33
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "Study of all known painting techniques of the past; e.g. fresco, casein and mineral paints tempera, watercolor, calsomine, encaustic oil paint, lacquer, metallic paint",
    "step_id": 2,
    "edge_type": null
  },
  {
    "interaction_id": 14,
    "from_nodes": [
      32
    ],
    "to_nodes": [
      29
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "Fundamental principles of color harmony; chemical nature of oils, varnishes, lacquers, dryers and pigments",
    "step_id": 2,
    "edge_type": null
  },
  {
    "interaction_id": 15,
    "from_nodes": [
      32
    ],
    "to_nodes": [
      15
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "Practical application of the new techniques discovered in the experimental workshop",
    "step_id": 2,
    "edge_type": null
  },
  {
    "interaction_id": 16,
    "from_nodes": [
      32
    ],
    "to_nodes": [
      45,46
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "Applicational projects for color schemes in given architectural models, plans and elevations, as well as posters",
    "step_id": 2,
    "edge_type": null
  },
  {
    "interaction_id": 17,
    "from_nodes": [
      32
    ],
    "to_nodes": [
      41,42
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "Knowledge of tools, erection of scaffolding, the making of stencils and cartoons, working drawings, perspectives, models; taking dimensions, preparing estimates, book keeping",
    "step_id": 2,
    "edge_type": null
  },
  {
    "interaction_id": 18,
    "from_nodes": [
      0,47,48
    ],
    "to_nodes": [
      40
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "Wall paper production was planned under Gropius. actual execution took place under Hannes Meyer and, later, Mies van der Rohe. The emphasis was not on pattern but on texture: solid colors were used, and a number of new techniques were introduced.",
    "step_id": 2,
    "edge_type": null
  },
  {
    "interaction_id": 19,
    "from_nodes": [
      40
    ],
    "to_nodes": [
      44
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "The influence on German manufacturers was very great; Bauhaus wall paper was widely imitated.",
    "step_id": 2,
    "edge_type": null
  },
  {
    "interaction_id": 20,
    "from_nodes": [
      8
    ],
    "to_nodes": [
      44
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "Designs for furniture, lamps, textile fabrics, metal- and glassware were accepted by manufacturers.",
    "step_id": 3,
    "edge_type": null
  },
  {
    "interaction_id": 21,
    "from_nodes": [
      2
    ],
    "to_nodes": [
      44
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "The factories were then often visited by Bauhaus designers who studied the processes used and cooperated with technicians to simplify and improve the designs.",
    "step_id": 3,
    "edge_type": null
  },
  {
    "interaction_id": 22,
    "from_nodes": [
      44
    ],
    "to_nodes": [
      2
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "Conversely, the factories often sent their technicians to the Bauhaus workshops to keep them informed about the development of designs. This was a great improvement over the ineffective dependence on paper projects against which the Bauhaus had rebelled as an inadequate means of communication between designers and industry.",
    "step_id": 3,
    "edge_type": null
  },
  {
    "interaction_id": 23,
    "from_nodes": [
      8,40
    ],
    "to_nodes": [
      49
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "When a workshop considered a design ready for sale it was turned over the Business Manager of the Corporation together with all the necessary drawings and descriptions of the processes involved so that contracts could be drawn up.",
    "step_id": 3,
    "edge_type": null
  },
  {
    "interaction_id": 24,
    "from_nodes": [
      44
    ],
    "to_nodes": [
      50,2
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "The income was divided between the Bauhaus Corporation and the school itself, which paid the designer. Half the royalty paid the school was credited to the Bauhaus fund, while the other half went to a welfare fund used to pay for designs which were considered valuable but which could not be disposed of for the time being. All Bauhaus workshops were involved in filling orders for industry. Sometimes, more than fifty firms were buying Bauhaus products to such an extent that the scarcity of machinery and capital made it impossible to fill all orders. Orders were received from abroad, from Austria, England, Holland, America.",
    "step_id": 3,
    "edge_type": null
  },
  {
    "interaction_id": 25,
    "from_nodes": [
      0
    ],
    "to_nodes": [
      2
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "Lead designer of Bauhaus Dessau building and new campus (Masters' Houses).",
    "step_id": 4,
    "edge_type": null
  },
  {
    "interaction_id": 26,
    "from_nodes": [
      51
    ],
    "to_nodes": [
      2
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "On December 4, 1926, the Bauhaus was formally inaugurated. The inaugural celebrations included an exhibition, lectures, motion pictures, as well as a dance in the new building. The inaugural address was delivered by National Art Director (Reichskunstwart) Erwin Redslob who had been born in Weimar and who had, from the very beginning, shown great interest in the Bauhaus.",
    "step_id": 4,
    "edge_type": null
  },
  {
    "interaction_id": 27,
    "from_nodes": [
      52
    ],
    "to_nodes": [
      2
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "The reopening of the Bauhaus under more prosperous conditions was regarded as a great cultural event and brought more than 1500 visitors to Dessau.",
    "step_id": 4,
    "edge_type": null
  },
  {
    "interaction_id": 28,
    "from_nodes": [
      53
    ],
    "to_nodes": [
      2
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "Sixty press representatives were present at the Bauhaus opening in 1925. Reports in the press indicated that only a few critics un derstood that the interior had been designed mainly by the workshops themselves. Most of them believed it had been designed by the architects and only executed by the workshops.",
    "step_id": 4,
    "edge_type": null
  },
  {
    "interaction_id": 29,
    "from_nodes": [
      32
    ],
    "to_nodes": [
      2
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "In the five upper stories, there are twenty eight studio apartments for students, and in addition each floor has a kitchenette. In the basement of the studio building there are baths, a gymnasium and locker-room, and an electric laundry.",
    "step_id": 5,
    "edge_type": null
  },
  {
    "interaction_id": 30,
    "from_nodes": [
      15
    ],
    "to_nodes": [
      56
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "The interior decoration of the entire building was executed by the wall-painting workshop.",
    "step_id": 5,
    "edge_type": null
  },
  {
    "interaction_id": 31,
    "from_nodes": [
      10
    ],
    "to_nodes": [
      54
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "The design and execution of all lighting fixtures by the metal workshop.",
    "step_id": 5,
    "edge_type": null
  },
  {
    "interaction_id": 32,
    "from_nodes": [
      11,57
    ],
    "to_nodes": [
      55
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "The tubular steel furniture of the assembly hall, dining room and studios was executed from designs by Marcel Breuer.",
    "step_id": 5,
    "edge_type": null
  },
  {
    "interaction_id": 33,
    "from_nodes": [
      59,60
    ],
    "to_nodes": [
      58
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "The tubular steel furniture of the assembly hall, dining room and studios was executed from designs by Marcel Breuer.",
    "step_id": 5,
    "edge_type": null
  },
  {
    "interaction_id": 34,
    "from_nodes": [
      32
    ],
    "to_nodes": [
      2
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "In 1920, the student body was composed of 200 Germans, 14 Austrians, 3 Germans from the Baltic countries, 2 Sudeten Germans and 2 Hungarians. 526 students were trained in the Bauhaus between October 1919, and April 1924. A large number of others took only the preliminary course.",
    "step_id": 5,
    "edge_type": null
  },
  {
    "interaction_id": 35,
    "from_nodes": [
      51
    ],
    "to_nodes": [
      1
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "At Weimar, the whole institute, including the director, was under the Jurisdiction of the Ministry of Public Education; at Dessau, this authority was vested in the municipal council.",
    "step_id": 6,
    "edge_type": null
  },
  {
    "interaction_id": 36,
    "from_nodes": [
      51
    ],
    "to_nodes": [
      1
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "The annual budget varied between 130,000 and 200,000 marks, At Weimar, it was prepared by the Minister of Public Education and submitted to the Thuringian Landtag; at Dessau the budget was prepared by the municipal council and submitted to the Sfadtparlament.",
    "step_id": 6,
    "edge_type": null
  },
  {
    "interaction_id": 37,
    "from_nodes": [
      4,5
    ],
    "to_nodes": [
      1
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "In the early years, the faculty had a nominal right to vote on vital decisions, in the belief that problems affecting creative work can never be solved by a majority, the right to vote was discarded in subsequent statutes; in fact, decisions by majority vote were dropped altogether.",
    "step_id": 6,
    "edge_type": null
  },
  {
    "interaction_id": 38,
    "from_nodes": [
      0
    ],
    "to_nodes": [
      1
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "Full responsibility was granted to the director by a unanimous vote.",
    "step_id": 6,
    "edge_type": null
  },
  {
    "interaction_id": 39,
    "from_nodes": [
      4,5,32
    ],
    "to_nodes": [
      1
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "The statutes provided, however, that all decisions had to be preceded by discussion, all instructors and the student representatives had the right to participate in these discussions.",
    "step_id": 6,
    "edge_type": null
  },
  {
    "interaction_id": 40,
    "from_nodes": [
      4,5
    ],
    "to_nodes": [
      1
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "For problems of internal organization and teaching: the Bauhaus council, made up of masters teaching problems of form and technical instructors in the workshops, would convene.",
    "step_id": 6,
    "edge_type": null
  },
  {
    "interaction_id": 41,
    "from_nodes": [
      49
    ],
    "to_nodes": [
      1,2
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "For the sale of models to industrial firms: the business manager (syndikus) who was in charge of the commercial activities of the Bauhaus and later of the Bauhaus corporation.",
    "step_id": 6,
    "edge_type": null
  },
  {
    "interaction_id": 42,
    "from_nodes": [
      0
    ],
    "to_nodes": [
      32
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "In the course of time it became possible to give the student body more and more direct influence in the affairs of the whole organization. Originally there was a student council which was consulted from time to time by the director.",
    "step_id": 6,
    "edge_type": null
  },
  {
    "interaction_id": 43,
    "from_nodes": [
      32
    ],
    "to_nodes": [
      4,5
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "Later on, the students were granted the right to send one delegate from each workshop to the faculty council when vital decisions were to be made. Still later, in Dessau, one or two student representatives attended all meetings of the faculty council.",
    "step_id": 6,
    "edge_type": null
  },
  {
    "interaction_id": 44,
    "from_nodes": [
      61
    ],
    "to_nodes": [
      17
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "Oskar Schlemmer delivered a lecture on stage craft and theater in March 1927. Previously, in Weimar, there was no theater space, and students used local stages.",
    "step_id": 7,
    "edge_type": null
  },
  {
    "interaction_id": 45,
    "from_nodes": [
      27
    ],
    "to_nodes": [
      17
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "Interested in interior space treated as part of the whole composition of the building, with a special emphasis on non-static interaction (with human actors).",
    "step_id": 7,
    "edge_type": null
  },
  {
    "interaction_id": 46,
    "from_nodes": [
      47
    ],
    "to_nodes": [
      0
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "Meyer went beyond Gropius’s 'fundamental research', which he thought was too fixated on the object. Using scientific methods, he analysed the lifestyle patterns of the future residents of a settlement or house and integrated biological and climatic on-site studies in the design process.",
    "step_id": 8,
    "edge_type": null
  },
  {
    "interaction_id": 47,
    "from_nodes": [
      9
    ],
    "to_nodes": [
      32
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "In addition to teaching in the arts and crafts, the programme of 1919 already included scientific-theoretical classes in subjects such as material science, physical and chemical colour theory, the history of technology, anatomy and business administration (especially book-keeping and contract management). In Dessau, where it effectively operated as a technical university, building trades school and academy, the Bauhaus had to meet the mandates of a vocational school. Among other things, these included a basic education in the natural sciences and general business skills. This aspect was already integrated in the educational framework, which taught illustrative geometry, mathematics, physics and chemistry alongside the principles of creative design.",
    "step_id": 8,
    "edge_type": null
  },
  {
    "interaction_id": 48,
    "from_nodes": [
      62
    ],
    "to_nodes": [
      2
    ],
    "from_color": null,
    "to_color": null,
    "interaction_description": "As a result, the Bauhaus was dependent on school cooperation partners for a long time. In Weimar, the main cooperation partner was the building trades school and in Dessau, the technical institutions and the vocational business school.",
    "step_id": 8,
    "edge_type": null
  }
]